nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxa276/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
                      /* Invert Input: Inverts. */
                      | PORT_PCR_INV(PCR_INV_inv1));

    /* PORT3_19 (pin 85) is configured as P3_19 */
    PORT_SetPinMux(BOARD_INITPINS_LED_GREEN_PORT, BOARD_INITPINS_LED_GREEN_PIN, kPORT_MuxAlt0);

    PORT3->PCR[19] = ((PORT3->PCR[19] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK | PORT_PCR_INV_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1)

                      /* Invert Input: Inverts. */
                      | PORT_PCR_INV(PCR_INV_inv1));

    /* PORT3_21 (pin 82) is configured as P3_21 */
    PORT_SetPinMux(BOARD_INITPINS_LED_BLUE_PORT, BOARD_INITPINS_LED_BLUE_PIN, kPORT_MuxAlt0);

    PORT3->PCR[21] = ((PORT3->PCR[21] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK | PORT_PCR_INV_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1)

                      /* Invert Input: Inverts. */
                      | PORT_PCR_INV(PCR_INV_inv1));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWM:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '106', peripheral: FlexPWM0, signal: 'A, 0', pin_signal: P3_0/WUU0_IN22/TRIG_IN0/LPUART3_RXD/CT_INP16/PWM0_A0/FLEXIO0_D8/PWM1_X0/LCD_P32/EZH_PIO0, direction: OUTPUT}
  - {pin_num: '105', peripheral: FlexPWM0, signal: 'B, 0', pin_signal: P3_1/TRIG_IN1/LPUART3_TXD/CT_INP17/PWM0_B0/FLEXIO0_D9/PWM1_X1/LCD_P33/EZH_PIO1/FREQME_CLK_OUT0,
    direction: OUTPUT}
  - {pin_num: '98', peripheral: FlexPWM0, signal: 'A, 1', pin_signal: P3_8/WUU0_IN23/TRIG_IN3/LPSPI1_SDO/LPUART1_RXD/CT_INP4/PWM0_A1/FLEXIO0_D16/LPUART5_CTS_B/LCD_P36/EZH_PIO8/CLKOUT,
    direction: OUTPUT}
  - {pin_num: '97', peripheral: FlexPWM0, signal: 'B, 1', pin_signal: P3_9/TRIG_IN4/LPSPI1_SDI/LPUART1_TXD/CT_INP5/PWM0_B1/FLEXIO0_D17/LPUART5_RTS_B/LCD_P37/EZH_PIO9,
    direction: OUTPUT}
  - {pin_num: '96', peripheral: FlexPWM0, signal: 'A, 2', pin_signal: P3_10/TRIG_IN5/LPSPI1_SCK/LPUART1_RTS_B/CT1_MAT0/PWM0_A2/FLEXIO0_D18/LPUART5_TXD/LCD_P38/EZH_PIO10,
    direction: OUTPUT}
  - {pin_num: '95', peripheral: FlexPWM0, signal: 'B, 2', pin_signal: P3_11/WUU0_IN24/TRIG_IN6/LPSPI1_PCS0/LPUART1_CTS_B/CT1_MAT1/PWM0_B2/FLEXIO0_D19/LPUART5_RXD/LCD_P39/EZH_PIO11,
    direction: OUTPUT}
  - {peripheral: FlexPWM0, signal: 'PWM_FAULT_TRG_CH, 0', pin_signal: cmp2_out}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWM
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWM(void)
{
    /* INPUTMUX0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateINPUTMUX0);
    /* PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* INPUTMUX0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kINPUTMUX0_RST_SHIFT_RSTn);
    /* FLEXPWM0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kFLEXPWM0_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);
    /*  Cmp2Out connect to FlexPwm0Fault 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_Cmp2OutToFlexPwm0Fault);

    /* PORT3_0 (pin 106) is configured as PWM0_A0 */
    PORT_SetPinMux(BOARD_INITPWM_PWM_AT_PORT, BOARD_INITPWM_PWM_AT_PIN, kPORT_MuxAlt5);

    PORT3->PCR[0] = ((PORT3->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_1 (pin 105) is configured as PWM0_B0 */
    PORT_SetPinMux(BOARD_INITPWM_PWM_AB_PORT, BOARD_INITPWM_PWM_AB_PIN, kPORT_MuxAlt5);

    PORT3->PCR[1] = ((PORT3->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_10 (pin 96) is configured as PWM0_A2 */
    PORT_SetPinMux(BOARD_INITPWM_PWM_CT_PORT, BOARD_INITPWM_PWM_CT_PIN, kPORT_MuxAlt5);

    PORT3->PCR[10] = ((PORT3->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_11 (pin 95) is configured as PWM0_B2 */
    PORT_SetPinMux(BOARD_INITPWM_PWM_CB_PORT, BOARD_INITPWM_PWM_CB_PIN, kPORT_MuxAlt5);

    PORT3->PCR[11] = ((PORT3->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_8 (pin 98) is configured as PWM0_A1 */
    PORT_SetPinMux(BOARD_INITPWM_PWM_BT_PORT, BOARD_INITPWM_PWM_BT_PIN, kPORT_MuxAlt5);

    PORT3->PCR[8] = ((PORT3->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_9 (pin 97) is configured as PWM0_B1 */
    PORT_SetPinMux(BOARD_INITPWM_PWM_BB_PORT, BOARD_INITPWM_PWM_BB_PIN, kPORT_MuxAlt5);

    PORT3->PCR[9] = ((PORT3->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADC:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '40', peripheral: ADC0, signal: 'A, 7', pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/FLEXIO0_D15/EZH_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7,
    identifier: CUR_A_ADC0}
  - {pin_num: '3', peripheral: ADC1, signal: 'A, 8', pin_signal: P1_10/LPUART1_RTS_B/LPI2C2_SDAS/CT2_MAT0/FLEXIO0_D18/EZH_PIO6/LPUART5_TXD/LCD_P8/CAN0_TXD/ADC1_A8}
  - {pin_num: '71', peripheral: ADC1, signal: 'A, 21', pin_signal: P3_30/TRIG_OUT6/LPI2C3_SCLS/LPUART4_RTS_B/CT0_MAT2/FLEXIO0_D30/PWM1_A0/EZH_PIO30/ADC1_A21}
  - {pin_num: '40', peripheral: ADC1, signal: 'A, 7', pin_signal: P2_7/TRIG_IN5/LPUART4_TXD/CT_INP19/CT1_MAT3/FLEXIO0_D15/EZH_PIO31/VREFI/ADC1_A7/ADC3_A7/ADC0_A7/ADC2_A7,
    identifier: CUR_A_ADC1}
  - {pin_num: '141', peripheral: ADC0, signal: 'A, 20', pin_signal: P1_4/WUU0_IN8/FREQME_CLK_IN0/LPSPI0_PCS3/LPUART2_RXD/CT1_MAT2/FLEXIO0_D12/EZH_PIO0/ADC0_A20/CMP0_IN2/LCD_VLL2,
    identifier: VOLT_DCB}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

